cvwt-upload-to-github/cfd/stage1/tests/foam/porous_duct/constant/momentumTransport
FoamFile
{
    format ascii;
    class dictionary;
    object momentumTransport;
}

simulationType laminar;
