cvwt-upload-to-github/cfd/stage1/tests/foam/porous_duct/constant/physicalProperties
FoamFile
{
    format ascii;
    class dictionary;
    object physicalProperties;
}

viscosityModel constant;
nu [0 2 -1 0 0 0 0] 1.51e-05;
