cvwt-upload-to-github/cfd/stage1/tests/foam/porous_duct/0/U
FoamFile
{
    format ascii;
    class volVectorField;
    object U;
}

dimensions [0 1 -1 0 0 0 0];
internalField uniform (0.06 0 0);
boundaryField
{
    inlet { type fixedValue; value uniform (0.06 0 0); }
    outlet { type zeroGradient; }
    walls { type slip; }
}
