cvwt-upload-to-github/cfd/stage1/tests/foam/porous_duct/0/p
FoamFile
{
    format ascii;
    class volScalarField;
    object p;
}

dimensions [0 2 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
    inlet { type zeroGradient; }
    outlet { type fixedValue; value uniform 0; }
    walls { type slip; }
}
