cvwt-upload-to-github/cfd/stage1/tests/foam/porous_duct/system/fvSolution
FoamFile
{
    format ascii;
    class dictionary;
    object fvSolution;
}

solvers
{
    p { solver GAMG; smoother GaussSeidel; tolerance 1e-10; relTol 0.01; }
    U { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-11; relTol 0.1; }
}
SIMPLE { nNonOrthogonalCorrectors 0; consistent yes; residualControl { p 1e-8; U 1e-9; } }
relaxationFactors { equations { U 0.9; ".*" 0.9; } }
